esp8266/Arduino/build/linux/work/hardware/tools/avr/lib/avr/include/avr/io90pwm316.h
/* PSC0 Interrupt Mask Register */
#define PIM0    _SFR_MEM8(0xA1)
#define PEOPE0  0   /* PSC0 End Of Cycle Interrupt Enable */
#define PEVE0A  3   /* PSC0 External Event A Interrupt Enable */
#define PEVE0B  4   /* PSC0 External Event B Interrupt Enable */
#define PSEIE0  5   /* PSC0 Synchro Error Interrupt Enable */

/* PSC1 Interrupt Flag Register */
#define PIFR1   _SFR_MEM8(0xA2)
#define PEOP1   0
#define PRN10   1
#define PRN11   2
#define PEV1A   3
#define PEV1B   4
#define PSEI1   5
#define POAC1A  6
#define POAC1B  7

/* PSC1 Interrupt Mask Register */
#define PIM1    _SFR_MEM8(0xA3)

/* PSC2 Interrupt Flag Register */
#define PIFR2   _SFR_MEM8(0xA4)
#define PEOP2   0   /* End Of PSC2 Interrupt */
#define PRN20   1   /* PSC2 Ramp Number bit0 */
#define PRN21   2   /* PSC2 Ramp Number bit1 */
#define PEV2A   3   /* PSC2 External Event A Interrupt */
#define PEV2B   4   /* PSC2 External Event B Interrupt */
#define PSEI2   5   /* PSC2 Synchro Error Interrupt */
#define POAC2A  6   /* PSC2 Output A Activity */
#define POAC2B  7   /* PSC2 Output B Activity */

/* PSC2 Interrupt Mask Register */
#define PIM2    _SFR_MEM8(0xA5)
#define PEOPE2  0   /* PSC2 End Of Cycle Interrupt Enable */
#define PEVE2A  3   /* PSC2 External Event A Interrupt Enable */
#define PEVE2B  4   /* PSC2 External Event B Interrupt Enable */
#define PSEIE2  5   /* PSC2 Synchro Error Interrupt Enable */

/* Digital to Analog Conversion Control Register */
#define DACON   _SFR_MEM8(0xAA)
#define DAEN    0   /* Digital to Analog Enable bit */
#define DAOE    1   /* Digital to Analog Output Enable bit */
#define DALA    2   /* Digital to Analog Left Adjust */
#define DATS0   4   /* DAC Trigger Selection bit0 */
#define DATS1   5   /* DAC Trigger Selection bit1 */
#define DATS2   6   /* DAC Trigger Selection bit2 */
#define DAATE   7   /* DAC Auto Trigger Enable bit */

/* Digital to Analog Converter input Register */
#define DAC     _SFR_MEM16(0xAB)
#define DACL    _SFR_MEM8(0xAB)
#define DACH    _SFR_MEM8(0xAC)

/* Analog Comparator 0 Control Register */
#define AC0CON  _SFR_MEM8(0xAD)
#define AC0M0   0   /* Analog Comparator 0 Multiplexer register bit0 */
#define AC0M1   1   /* Analog Comparator 0 Multiplexer register bit1 */
#define AC0M2   2   /* Analog Comparator 0 Multiplexer register bit2 */
#define AC0IS0  4   /* Analog Comparator 0 Interrupt Select bit0 */
#define AC0IS1  5   /* Analog Comparator 0 Interrupt Select bit1 */
#define AC0IE   6   /* Analog Comparator 0 Interrupt Enable bit */
#define AC0EN   7   /* Analog Comparator 0 Enable Bit */

/* Analog Comparator 1 Control Register */
#define AC1CON  _SFR_MEM8(0xAE)
#define AC1M0   0   /* Analog Comparator 1 Multiplexer register bit0 */
#define AC1M1   1   /* Analog Comparator 1 Multiplexer register bit1 */
#define AC1M2   2   /* Analog Comparator 1 Multiplexer register bit2 */
#define AC1ICE  3   /* Analog Comparator 1 Interrupt Capture Enable bit */
#define AC1IS0  4   /* Analog Comparator 1 Interrupt Select bit0 */
#define AC1IS1  5   /* Analog Comparator 1 Interrupt Select bit1 */
#define AC1IE   6   /* Analog Comparator 1 Interrupt Enable bit */
#define AC1EN   7   /* Analog Comparator 1 Enable Bit */

/* Analog Comparator 2 Control Register */
#define AC2CON  _SFR_MEM8(0xAF)
#define AC2M0   0   /* Analog Comparator 2 Multiplexer register bit0 */
#define AC2M1   1   /* Analog Comparator 2 Multiplexer register bit1 */
#define AC2M2   2   /* Analog Comparator 2 Multiplexer register bit2 */
#define AC2IS0  4   /* Analog Comparator 2 Interrupt Select bit0 */
#define AC2IS1  5   /* Analog Comparator 2 Interrupt Select bit1 */
#define AC2IE   6   /* Analog Comparator 2 Interrupt Enable bit */
#define AC2EN   7   /* Analog Comparator 2 Enable Bit */

/* USART Control and Status Register A */
#define UCSRA   _SFR_MEM8(0xC0)
#define MPCM    0   /* Multi-processor Communication Mode */
#define U2X     1   /* Double the USART Transmission Speed */
#define UPE     2   /* USART Parity Error */
#define DOR     3   /* Data OverRun */
#define FE      4   /* Frame Error */
#define UDRE    5   /* USART Data Register Empty */
#define TXC     6   /* USART Transmit Complete */
#define RXC     7   /* USART Receive Complete */

/* USART Control and Status Register B */
#define UCSRB   _SFR_MEM8(0xC1)
#define TXB8    0   /* Transmit Data Bit 8 */
#define RXB8    1   /* Receive Data Bit 8 */
#define UCSZ2   2   /* Character Size */
#define TXEN    3   /* Transmitter Enable */
#define RXEN    4   /* Receiver Enable */
#define UDRIE   5   /* USART Data Register Empty Interrupt Enable */
#define TXCIE   6   /* TX Complete Interrupt Enable */
#define RXCIE   7   /* RX Complete Interrupt Enable */

/* USART Control and Status Register C */
#define UCSRC   _SFR_MEM8(0xC2)
#define UCPOL   0   /* Clock Polarity */
#define UCSZ0   1   /* Character Size bit0 */
#define UCSZ1   2   /* Character Size bit1 */
#define USBS    3   /* Stop Bit Select */
#define UPM0    4   /* Parity Mode bit0 */
#define UPM1    5   /* Parity Mode bit1 */
#define UMSEL   6   /* USART Mode Select */

/* USART Baud Rate Register */
#define UBRR    _SFR_MEM16(0xC4)
#define UBRRL   _SFR_MEM8(0xC4)
#define UBRRH   _SFR_MEM8(0xC5)

/* USART I/O Data Register */
#define UDR     _SFR_MEM8(0xC6)

/* EUSART Control and Status Register A */
#define EUCSRA  _SFR_MEM8(0xC8)
#define URxS0   0   /* EUSART Receive Character Size bit0 */
#define URxS1   1   /* EUSART Receive Character Size bit1 */
#define URxS2   2   /* EUSART Receive Character Size bit2 */
#define URxS3   3   /* EUSART Receive Character Size bit3 */
#define UTxS0   4   /* EUSART Transmit Character Size bit0 */
#define UTxS1   5   /* EUSART Transmit Character Size bit1 */
#define UTxS2   6   /* EUSART Transmit Character Size bit2 */
#define UTxS3   7   /* EUSART Transmit Character Size bit3 */

/* EUSART Control and Status Register B */
#define EUCSRB  _SFR_MEM8(0xC9)
#define BODR    0   /* Bit Order */
#define EMCH    1   /* Manchester mode */
#define EUSBS   3   /* EUSBS Enable Bit */
#define EUSART  4   /* EUSART Enable Bit */

