esp8266/Arduino/build/linux/work/hardware/tools/avr/lib/avr/include/avr/io90pwm316.h
/* EUSART Control and Status Register C */
#define EUCSRC  _SFR_MEM8(0xCA)
#define STP0    0   /* Stop bits values bit0 */
#define STP1    1   /* Stop bits values bit1 */
#define F1617   2
#define FEM     3   /* Frame Error Manchester */

/* Manchester receiver Baud Rate Registers */
#define MUBRR   _SFR_MEM16(0xCC)
#define MUBRRL  _SFR_MEM8(0xCC)
#define MUBRRH  _SFR_MEM8(0xCD)

/* EUSART I/O Data Register */
#define EUDR    _SFR_MEM8(0xCE)

/* PSC 0 Synchro and Output Configuration */
#define PSOC0   _SFR_MEM8(0xD0)
#define POEN0A  0   /* PSC 0 OUT Part A Output Enable */
#define POEN0B  2   /* PSC 0 OUT Part B Output Enable */
#define PSYNC00 4   /* Synchronization Out for ADC Selection bit0 */
#define PSYNC01 5   /* Synchronization Out for ADC Selection bit1 */

/* Output Compare SA Registers */
#define OCR0SA  _SFR_MEM16(0xD2)
#define OCR0SAL _SFR_MEM8(0xD2)
#define OCR0SAH _SFR_MEM8(0xD3)

/* Output Compare RA Registers */
#define OCR0RA  _SFR_MEM16(0xD4)
#define OCR0RAL _SFR_MEM8(0xD4)
#define OCR0RAH _SFR_MEM8(0xD5)

/* Output Compare SB Registers */
#define OCR0SB  _SFR_MEM16(0xD6)
#define OCR0SBL _SFR_MEM8(0xD6)
#define OCR0SBH _SFR_MEM8(0xD7)

/* Output Compare RB Registers */
#define OCR0RB  _SFR_MEM16(0xD8)
#define OCR0RBL _SFR_MEM8(0xD8)
#define OCR0RBH _SFR_MEM8(0xD9)

/* PSC 0 Configuration Register */
#define PCNF0   _SFR_MEM8(0xDA)
#define PCLKSEL0 1  /* PSC 0 Input Clock Select */
#define POP0     2  /* PSC 0 Output Polarity */
#define PMODE00  3  /* PSC 0 Mode bit0 */
#define PMODE01  4  /* PSC 0 Mode bit1 */
#define PLOCK0   5  /* PSC 0 Lock */
#define PALOCK0  6  /* PSC 0 Autolock */
#define PFIFTY0  7  /* PSC 0 Fifty */

/* PSC 0 Control Register */
#define PCTL0   _SFR_MEM8(0xDB)
#define PRUN0   0   /* PSC 0 Run */
#define PCCYC0  1   /* PSC 0 Complete Cycle */
#define PARUN0  2   /* PSC 0 Autorun */
#define PAOC0A  3   /* PSC 0 Asynchronous Output Control A */
#define PAOC0B  4   /* PSC 0 Asynchronous Output Control B */
#define PBFM0   5   /* Balance Flank Width Modulation */
#define PPRE00  6   /* PSC 0 Prescaler Select bit0 */
#define PPRE01  7   /* PSC 0 Prescaler Select bit1 */

/* PSC 0 Input A Control Register */
#define PFRC0A  _SFR_MEM8(0xDC)
#define PRFM0A0 0   /* PSC 0 Fault Mode bit0 */
#define PRFM0A1 1   /* PSC 0 Fault Mode bit1 */
#define PRFM0A2 2   /* PSC 0 Fault Mode bit2 */
#define PRFM0A3 3   /* PSC 0 Fault Mode bit3 */
#define PFLTE0A 4   /* PSC 0 Filter Enable on Input Part A */
#define PELEV0A 5   /* PSC 0 Edge Level Selector of Input Part A */
#define PISEL0A 6   /* PSC 0 Input Select for Part A */
#define PCAE0A  7   /* PSC 0 Capture Enable Input Part A */

/* PSC 0 Input B Control Register */
#define PFRC0B  _SFR_MEM8(0xDD)
#define PRFM0B0 0   /* PSC 0 Fault Mode bit0 */
#define PRFM0B1 1   /* PSC 0 Fault Mode bit1 */
#define PRFM0B2 2   /* PSC 0 Fault Mode bit2 */
#define PRFM0B3 3   /* PSC 0 Fault Mode bit3 */
#define PFLTE0B 4   /* PSC 0 Filter Enable on Input Part B */
#define PELEV0B 5   /* PSC 0 Edge Level Selector of Input Part B */
#define PISEL0B 6   /* PSC 0 Input Select for Part B */
#define PCAE0B  7   /* PSC 0 Capture Enable Input Part B */

/* PSC 0 Input Capture Registers */
#define PICR0   _SFR_MEM16(0xDE)
#define PICR0L  _SFR_MEM8(0xDE)
#define PICR0H  _SFR_MEM8(0xDF)
#define PCST0   7   /* PSC Capture Software Trig bit */

/* PSC 1 Synchro and Output Configuration */
#define PSOC1   _SFR_MEM8(0xE0)
#define POEN1A 0
#define POEN1B 2
#define PSYNC1_0 4
#define PSYNC1_1 5

/* Output Compare SA Registers */
#define OCR1SA  _SFR_MEM16(0xE2)
#define OCR1SAL _SFR_MEM8(0xE2)
#define OCR1SAH _SFR_MEM8(0xE3)

/* Output Compare RA Registers */
#define OCR1RA  _SFR_MEM16(0xE4)
#define OCR1RAL _SFR_MEM8(0xE4)
#define OCR1RAH _SFR_MEM8(0xE5)

/* Output Compare SB Registers */
#define OCR1SB  _SFR_MEM16(0xE6)
#define OCR1SBL _SFR_MEM8(0xE6)
#define OCR1SBH _SFR_MEM8(0xE7)

/* Output Compare RB Registers */
#define OCR1RB  _SFR_MEM16(0xE8)
#define OCR1RBL _SFR_MEM8(0xE8)
#define OCR1RBH _SFR_MEM8(0xE9)

/* PSC 1 Configuration Register */
#define PCNF1   _SFR_MEM8(0xEA)
#define PCLKSEL1 1
#define POP1     2
#define PMODE10  3
#define PMODE11  4
#define PLOCK1   5
#define PALOCK1  6
#define PFIFTY1  7

/* PSC 1 Control Register */
#define PCTL1   _SFR_MEM8(0xEB)
#define PRUN1  0
#define PCCYC1 1
#define PARUN1 2
#define PAOC1A 3
#define PAOC1B 4
#define PBFM1  5
#define PPRE10 6
#define PPRE11 7

/* PSC 1 Input A Control Register */
#define PFRC1A  _SFR_MEM8(0xEC)
#define PRFM1A0 0
#define PRFM1A1 1
#define PRFM1A2 2
#define PRFM1A3 3
#define PFLTE1A 4
#define PELEV1A 5
#define PISEL1A 6
#define PCAE1A  7

/* PSC 1 Input B Control Register */
#define PFRC1B  _SFR_MEM8(0xED)
#define PRFM1B0 0
#define PRFM1B1 1
#define PRFM1B2 2
#define PRFM1B3 3
#define PFLTE1B 4
#define PELEV1B 5
#define PISEL1B 6
#define PCAE1B  7

/* PSC 1 Input Capture Registers */
#define PICR1   _SFR_MEM16(0xEE)
#define PICR1L  _SFR_MEM8(0xEE)
#define PICR1H  _SFR_MEM8(0xEF)

/* PSC 2 Synchro and Output Configuration */
#define PSOC2   _SFR_MEM8(0xF0)
#define POEN2A  0   /* PSC 2 OUT Part A Output Enable */
#define POEN2C  1   /* PSCOUT22 Output Enable */
#define POEN2B  2   /* PSC 2 OUT Part B Output Enable */
#define POEN2D  3   /* PSCOUT23 Output Enable */
#define PSYNC20 4   /* Synchronization Out for ADC Selection bit0 */
#define PSYNC21 5   /* Synchronization Out for ADC Selection bit1 */
#define POS22   6   /* PSCOUT22 Selection */
#define POS23   7   /* PSCOUT23 Selection */

/* PSC 2 Output Matrix */
#define POM2    _SFR_MEM8(0xF1)
#define POMV2A0 0   /* Output Matrix Output A Ramp 0 */
#define POMV2A1 1   /* Output Matrix Output A Ramp 1 */
#define POMV2A2 2   /* Output Matrix Output A Ramp 2 */
#define POMV2A3 3   /* Output Matrix Output A Ramp 3 */
#define POMV2B0 4   /* Output Matrix Output B Ramp 0 */
#define POMV2B1 5   /* Output Matrix Output B Ramp 1 */
#define POMV2B2 6   /* Output Matrix Output B Ramp 2 */
#define POMV2B3 7   /* Output Matrix Output B Ramp 3 */

/* Output Compare SA Registers */
#define OCR2SA  _SFR_MEM16(0xF2)
#define OCR2SAL _SFR_MEM8(0xF2)
#define OCR2SAH _SFR_MEM8(0xF3)

/* Output Compare RA Registers */
#define OCR2RA  _SFR_MEM16(0xF4)
#define OCR2RAL _SFR_MEM8(0xF4)
#define OCR2RAH _SFR_MEM8(0xF5)

/* Output Compare SB Registers */
#define OCR2SB  _SFR_MEM16(0xF6)
#define OCR2SBL _SFR_MEM8(0xF6)
#define OCR2SBH _SFR_MEM8(0xF7)

/* Output Compare RB Registers */
#define OCR2RB  _SFR_MEM16(0xF8)
#define OCR2RBL _SFR_MEM8(0xF8)
#define OCR2RBH _SFR_MEM8(0xF9)

/* PSC 2 Configuration Register */
#define PCNF2   _SFR_MEM8(0xFA)
#define POME2    0  /* PSC 2 Output Matrix Enable */
#define PCLKSEL2 1  /* PSC 2 Input Clock Select */
#define POP2     2  /* PSC 2 Output Polarity */
#define PMODE20  3  /* PSC 2 Mode bit0 */
#define PMODE21  4  /* PSC 2 Mode bit1 */
#define PLOCK2   5  /* PSC 2 Lock */
#define PALOCK2  6  /* PSC 2 Autolock */
#define PFIFTY2  7  /* PSC 2 Fifty */

