esp8266/Arduino/build/linux/work/hardware/tools/avr/lib/avr/include/avr/io90pwm316.h
/* PSC 2 Control Register */
#define PCTL2   _SFR_MEM8(0xFB)
#define PRUN2   0   /* PSC 2 Run */
#define PCCYC2  1   /* PSC 2 Complete Cycle */
#define PARUN2  2   /* PSC 2 Autorun */
#define PAOC2A  3   /* PSC 2 Asynchronous Output Control A */
#define PAOC2B  4   /* PSC 2 Asynchronous Output Control B */
#define PBFM2   5   /* Balance Flank Width Modulation */
#define PPRE20  6   /* PSC 2 Prescaler Select bit0 */
#define PPRE21  7   /* PSC 2 Prescaler Select bit1 */

/* PSC 2 Input A Control Register */
#define PFRC2A  _SFR_MEM8(0xFC)
#define PRFM2A0 0   /* PSC 2 Fault Mode bit0 */
#define PRFM2A1 1   /* PSC 2 Fault Mode bit1 */
#define PRFM2A2 2   /* PSC 2 Fault Mode bit2 */
#define PRFM2A3 3   /* PSC 2 Fault Mode bit3 */
#define PFLTE2A 4   /* PSC 2 Filter Enable on Input Part A */
#define PELEV2A 5   /* PSC 2 Edge Level Selector of Input Part A */
#define PISEL2A 6   /* PSC 2 Input Select for Part A */
#define PCAE2A  7   /* PSC 2 Capture Enable Input Part A */

/* PSC 2 Input B Control Register */
#define PFRC2B  _SFR_MEM8(0xFD)
#define PRFM2B0 0   /* PSC 2 Fault Mode bit0 */
#define PRFM2B1 1   /* PSC 2 Fault Mode bit1 */
#define PRFM2B2 2   /* PSC 2 Fault Mode bit2 */
#define PRFM2B3 3   /* PSC 2 Fault Mode bit3 */
#define PFLTE2B 4   /* PSC 2 Filter Enable on Input Part B */
#define PELEV2B 5   /* PSC 2 Edge Level Selector of Input Part B */
#define PISEL2B 6   /* PSC 2 Input Select for Part B */
#define PCAE2B  7   /* PSC 2 Capture Enable Input Part B */

/* PSC 2 Input Capture Registers */
#define PICR2   _SFR_MEM16(0xFE)
#define PICR2L  _SFR_MEM8(0xFE)
#define PICR2H  _SFR_MEM8(0xFF)
#define PCST2   7   /* PSC Capture Software Trig bit */


/* Interrupt Vectors */
/* Interrupt 0 is the reset vector. */

/* PSC2 Capture Event */
#define PSC2_CAPT_vect     _VECTOR(1)

/* PSC2 End Cycle */
#define PSC2_EC_vect       _VECTOR(2)

/* PSC1 Capture Event */
#define PSC1_CAPT_vect     _VECTOR(3)

/* PSC1 End Cycle */
#define PSC1_EC_vect       _VECTOR(4)

/* PSC0 Capture Event */
#define PSC0_CAPT_vect     _VECTOR(5)

/* PSC0 End Cycle */
#define PSC0_EC_vect       _VECTOR(6)

/* Analog Comparator 0 */
#define ANALOG_COMP_0_vect _VECTOR(7)

/* Analog Comparator 1 */
#define ANALOG_COMP_1_vect _VECTOR(8)

/* Analog Comparator 2 */
#define ANALOG_COMP_2_vect _VECTOR(9)

/* External Interrupt Request 0 */
#define INT0_vect          _VECTOR(10)

/* Timer/Counter1 Capture Event */
#define TIMER1_CAPT_vect   _VECTOR(11)

/* Timer/Counter1 Compare Match A */
#define TIMER1_COMPA_vect  _VECTOR(12)

/* Timer/Counter Compare Match B */
#define TIMER1_COMPB_vect  _VECTOR(13)

/* Timer/Counter1 Overflow */
#define TIMER1_OVF_vect    _VECTOR(15)

/* Timer/Counter0 Compare Match A */
#define TIMER0_COMP_A_vect _VECTOR(16)

/* Timer/Counter0 Overflow */
#define TIMER0_OVF_vect    _VECTOR(17)

/* ADC Conversion Complete */
#define ADC_vect           _VECTOR(18)

/* External Interrupt Request 1 */
#define INT1_vect          _VECTOR(19)

/* SPI Serial Transfer Complete */
#define SPI_STC_vect       _VECTOR(20)

/* USART, Rx Complete */
#define USART_RX_vect      _VECTOR(21)

/* USART Data Register Empty */
#define USART_UDRE_vect    _VECTOR(22)

/* USART, Tx Complete */
#define USART_TX_vect      _VECTOR(23)

/* External Interrupt Request 2 */
#define INT2_vect          _VECTOR(24)

/* Watchdog Timeout Interrupt */
#define WDT_vect           _VECTOR(25)

/* EEPROM Ready */
#define EE_READY_vect      _VECTOR(26)

/* Timer Counter 0 Compare Match B */
#define TIMER0_COMPB_vect  _VECTOR(27)

/* External Interrupt Request 3 */
#define INT3_vect          _VECTOR(28)

/* Store Program Memory Read */
#define SPM_READY_vect     _VECTOR(31)

#define _VECTORS_SIZE   (4 * 32)

/* Constants */

#define RAMEND         0x4FF
#define XRAMSIZE       0
#define XRAMEND        (RAMEND + XRAMSIZE)
#define E2END          0x1FF
#define E2PAGESIZE     4
#define FLASHEND       0x3FFF
#define SPM_PAGESIZE   128


/* Fuse Information */

#define FUSE_MEMORY_SIZE 3

/* Low Fuse Byte */
#define FUSE_CKSEL0  (unsigned char)~_BV(0)  /* Select Clock Source */
#define FUSE_CKSEL1  (unsigned char)~_BV(1)  /* Select Clock Source */
#define FUSE_CKSEL2  (unsigned char)~_BV(2)  /* Select Clock Source */
#define FUSE_CKSEL3  (unsigned char)~_BV(3)  /* Select Clock Source */
#define FUSE_SUT0    (unsigned char)~_BV(4)  /* Select start-up time */
#define FUSE_SUT1    (unsigned char)~_BV(5)  /* Select start-up time */
#define FUSE_CKOUT   (unsigned char)~_BV(6)  /* Oscillator output option */
#define FUSE_CKDIV8  (unsigned char)~_BV(7)  /* Divide clock by 8 */
#define LFUSE_DEFAULT (FUSE_CKSEL0 & FUSE_CKSEL2 & FUSE_CKSEL3 & FUSE_SUT0 & FUSE_CKDIV8)

/* High Fuse Byte */
#define FUSE_BODLEVEL0 (unsigned char)~_BV(0)
#define FUSE_BODLEVEL1 (unsigned char)~_BV(1)
#define FUSE_BODLEVEL2 (unsigned char)~_BV(2)
#define FUSE_EESAVE    (unsigned char)~_BV(3)  /* EEPROM memory is preserved through chip erase */
#define FUSE_WDTON     (unsigned char)~_BV(4)  /* Watchdog timer always on */
#define FUSE_SPIEN     (unsigned char)~_BV(5)  /* Enable Serial programming and Data Downloading */
#define FUSE_DWEN      (unsigned char)~_BV(6)  /* debugWIRE Enable */
#define FUSE_RSTDISBL  (unsigned char)~_BV(7)  /* External Reset Diasble */
#define HFUSE_DEFAULT (FUSE_SPIEN)

/* Extended Fuse Byte */
#define FUSE_BOOTRST  (unsigned char)~_BV(0)  /* Select Reset Vector */
#define FUSE_BOOTSZ0  (unsigned char)~_BV(1)  /* Select Boot Size */
#define FUSE_BOOTSZ1  (unsigned char)~_BV(2)  /* Select Boot Size */
#define FUSE_PSCRV    (unsigned char)~_BV(4)
#define FUSE_PSC0RB   (unsigned char)~_BV(5)
#define FUSE_PSC1RB   (unsigned char)~_BV(6)
#define FUSE_PSC2RB   (unsigned char)~_BV(7)
#define EFUSE_DEFAULT (FUSE_BOOTSZ0 & FUSE_BOOTSZ1)


/* Lock Bits */
#define __LOCK_BITS_EXIST
#define __BOOT_LOCK_BITS_0_EXIST
#define __BOOT_LOCK_BITS_1_EXIST 


/* Signature */
#define SIGNATURE_0 0x1E
#define SIGNATURE_1 0x94
#define SIGNATURE_2 0x83


#endif /* _AVR_IO90PWM316_H_ */
